---
type: RoutingCondition
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# RoutingCondition

`Autodesk.Revit.DB.RoutingCondition` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RoutingCondition | 2013 | `public RoutingCondition ( double diameter )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Diameter | 2013 | `public double Diameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |